let recipe1 = {
  name: 'Киндер штангле',
  difficulty: 'Тежак',
  ingredients: [
    'Шећер',
    'Вода',
    'Маргарин',
    'Чоколада',
    'Ораси',
    'Кекс',
    'Млеко у праху'
  ]
};

let recipe2 = {
  name: 'Шпагете у белом сосу',
  difficulty: 'Средњи',
  ingredients: [
    'Шпагете',
    'Павлака за кување',
    'Бели лук',
    'Ћуреће месо',
    'Маслац',
    'Јаја',
    'Бибер',
    'Со'
  ]
};

let recipe3 = {
  name: 'Кувана јаја',
  difficulty: 'Почетни',
  ingredients: [
    'Јаја',
    'Вода'
  ]
};

let recipe4 = {
  name: 'Пржена јаја',
  difficulty: 'Почетни',
  ingredients: [
    'Јаја',
    'Уље'
  ]
};

let recipe5 = {
  name: 'Куване виршле',
  difficulty: 'Почетни',
  ingredients: [
    'Виршле',
    'Вода'
  ]
};

let recipe6 = {
  name: 'Грашак са јунећим месом',
  difficulty: 'Мајстор',
  ingredients: [
    'Јунетина',
    'Грашак',
    'Шаргарепа',
    'Црни лук',
    'Суви биљни зачин',
    'Бели лук',
    'Бибер',
    'Ловор',
    'Слатка млевена паприка',
    'Брашно',
    'Путер',
    'Уље'
  ]
};

let recipe7 = {
  name: 'Пуж погача са маргарином',
  difficulty: 'Средњи',
  ingredients: [
    'Млеко',
    'Квасац',
    'Брашно',
    'Шећер',
    'Со',
    'Маргарин',
    'Јаја'
  ]
};

let recipe8 = {
  name: 'Торта Пахуљица',
  difficulty: 'Тежак',
  ingredients: [
    'Јаја',
    'Шећер',
    'Брашно',
    'Прашак за пециво',
    'Млеко',
    'Ванилин шећер',
    'Чоколада за кување',
    'Јафа кекс',
    'Слатка павлака',
    'Желатин фикс'
  ]
};

let recipe9 = {
  name: 'Пилећи паприкаш са кромпиром',
  difficulty: 'Средњи',
  ingredients: [
    'Пиле',
    'Кромпир',
    'Уље',
    'Шаргарепа',
    'Парадајз',
    'Црни лук',
    'Паприка',
    'Алева паприка',
    'Першун',
    'Бибер',
    'Со'
  ]
};

let recipe10 = {
  name: 'Тесто за палачинке',
  difficulty: 'Лак',
  ingredients: [
    'Брашно',
    'Јаја',
    'Уље',
    'Млеко',
    'Вода',
    'Со',
    'Шећер'
  ]
};

let recipe11 = {
  name: 'Штрудла са џемом',
  difficulty: 'Средњи',
  ingredients: [
    'Брашно',
    'Млеко',
    'Уље',
    'Јаја',
    'Квасац',
    'Со',
    'Шећер',
    'Џем'
  ]
};

let recipe12 = {
  name: 'Грашак са јунећим месом',
  difficulty: 'Лак',
  ingredients: [
    'Брашно',
    'Прашак за пециво',
    'Квасац',
    'Млеко',
    'Шећер',
    'Со',
    'Уље',
    'Кисела павлака'
  ]
};

function printRecipe(recipe) {
  console.log(`${recipe.name}:\nТежина: ${recipe.difficulty}\nСастојци: ${recipe.ingredients.join(', ')}`);
}

printRecipe(recipe1);